/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   asm.h                                              :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: ajon-hol <ajon-hol@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/05/23 18:45:35 by ajon-hol          #+#    #+#             */
/*   Updated: 2019/05/23 19:31:57 by ajon-hol         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

парсер
структура под распарсенные элементы
ассоциативный массив для операций
ассоциативный массив для типов аргументов
сборщик
